In [2]:
import pandas as pd
import numpy as np
X = pd.DataFrame([pd.Series([0,-2,7,3]), pd.Series([0,0,1,-3])])
X

   0  1  2  3
0  0 -2  7  3
1  0  0  1 -3

In [3]:
Y = pd.DataFrame(np.array([range(1,5), [0,1,2,0]]))
Y

   0  1  2  3
0  1  2  3  4
1  0  1  2  0

In [4]:
Z = pd.DataFrame(np.array([[0,0,1,8],[6,1,0,0]]), columns=['c1', 'c2', 'c3', 'c4'])
Z

   c1  c2  c3  c4
0   0   0   1   8
1   6   1   0   0

In [17]:
records =[['John', 'Watson', 'M', 30], ['Praksh','Bhatta', 'M', 29], ['Sadichha','Sitaula', 'F', 30]]
titles = ['First Name', 'Last Name', 'Sex', 'Age']
X = pd.DataFrame(records, columns=titles)
print(X)
print(X.T)
print(X.shape)
print(X.ndim)
print(X.size)
print(len(X))

  First Name Last Name Sex  Age
0       John    Watson   M   30
1     Praksh    Bhatta   M   29
2   Sadichha   Sitaula   F   30
                 0       1         2
First Name    John  Praksh  Sadichha
Last Name   Watson  Bhatta   Sitaula
Sex              M       M         F
Age             30      29        30
(3, 4)
2
12
3

In [19]:
X.values

array([['John', 'Watson', 'M', 30],
       ['Praksh', 'Bhatta', 'M', 29],
       ['Sadichha', 'Sitaula', 'F', 30]], dtype=object)

In [21]:
X.columns

Index(['First Name', 'Last Name', 'Sex', 'Age'], dtype='object')

In [22]:
[X.columns[0], X.columns[1], X.columns[2]]

['First Name', 'Last Name', 'Sex']

In [23]:
X.index

RangeIndex(start=0, stop=3, step=1)

In [24]:
X.axes[0]

RangeIndex(start=0, stop=3, step=1)

In [25]:
X.axes[1]

Index(['First Name', 'Last Name', 'Sex', 'Age'], dtype='object')

In [6]:
X = np.arange(1,5)
Y = ['A', 'B', 'C', 'D']
Z = ['True', 'False', 'True', 'False']
R = np.random.random(size=4)
df1 = pd.DataFrame({'col1':X, 'col2':Y, 'col3':Z, 'col4':R})
df1

   col1 col2   col3      col4
0     1    A   True  0.461472
1     2    B  False  0.849551
2     3    C   True  0.470281
3     4    D  False  0.448493

In [7]:
df2 = pd.DataFrame([X, Y, Z, R], index=['key1', 'key2', 'key3', 'key4'])
df2

             0         1         2         3
key1         1         2         3         4
key2         A         B         C         D
key3      True     False      True     False
key4  0.461472  0.849551  0.470281  0.448493

In [8]:
df3 = pd.DataFrame({'col1':X, 'col2':Y, 'col3':Z, 'col4':R},index=['key1', 'key2', 'key3', 'key4'] )
df3

      col1 col2   col3      col4
key1     1    A   True  0.461472
key2     2    B  False  0.849551
key3     3    C   True  0.470281
key4     4    D  False  0.448493

In [26]:
name = [np.nan, 'Mary', 'Kate']
age = [14, 30, None]
DF = pd.DataFrame({'name':name, 'age':age})
DF

   name   age
0   NaN  14.0
1  Mary  30.0
2  Kate   NaN

In [29]:
a1 = ['John', 14]
a2 = ['Marry', 30]
a3 = ['Kate', np.nan]
v = ['name','age']
DF1 = pd.DataFrame([a1, a2, a3], columns=v)
DF1

    name   age
0   John  14.0
1  Marry  30.0
2   Kate   NaN

In [31]:
DF2 = pd.DataFrame([a1,a2,a3])
DF2

       0     1
0   John  14.0
1  Marry  30.0
2   Kate   NaN

In [32]:
DF1

    name   age
0   John  14.0
1  Marry  30.0
2   Kate   NaN

In [33]:
print(DF1.columns)

Index(['name', 'age'], dtype='object')

In [34]:
print(DF1.columns[0])

name

In [37]:
print(DF1.axes[1])

Index(['name', 'age'], dtype='object')

In [38]:
print(DF1.axes[1][0])

name

In [39]:
print(DF.axes[0])

RangeIndex(start=0, stop=3, step=1)

In [42]:
r = DF.axes[0][1]
r

1

In [49]:
DF[r:(r+2)]

   name   age
1  Mary  30.0
2  Kate   NaN

In [50]:
DF

   name   age
0   NaN  14.0
1  Mary  30.0
2  Kate   NaN

In [51]:
DF.T

        0     1     2
name  NaN  Mary  Kate
age    14    30   NaN

In [52]:
DF.shape

(3, 2)

In [54]:
DF.shape[0], len(DF)

(3, 3)

In [55]:
DF.ndim

2

In [56]:
DF.size

6

In [57]:
DF.values

array([[nan, 14.0],
       ['Mary', 30.0],
       ['Kate', nan]], dtype=object)

In [58]:
type(DF.values)

numpy.ndarray

In [59]:
list(DF)

['name', 'age']

In [66]:
coffe= pd.read_csv('coffee_info.csv')

In [70]:
coffe.head(10)

,Person_ID,Cups_Per_Week,Age,Gender,Employment,Education,Income,Married,Own_Home,Smoker,Favourite_NonAlc_Drink,Veg,cup_tea,spend_food
0,5,1,60.0,F,fulltime,high school,45000.0,married,no,yes,tea,nonveg,0,11787
1,6,1,40.0,F,fulltime,high school,46000.0,married,no,no,other,veg,6,18674
2,9,3,NaN,F,fulltime,high school,47000.0,married,no,no,coffee,veg,1,14814
3,14,5,20.0,F,fulltime,gradschool,65000.0,single,no,yes,softdrink,nonveg,0,22997
4,15,0,50.0,F,fulltime,high school,46000.0,married,yes,no,coffee,nonveg,5,14606
5,18,0,60.0,F,fulltime,high school,46000.0,single,yes,no,coffee,nonveg,6,14699
6,21,0,50.0,F,fulltime,high school,47000.0,married,no,yes,coffee,veg,1,23307
7,23,1,40.0,F,fulltime,high school,46000.0,single,no,no,coffee,nonveg,1,15928
8,26,1,60.0,F,fulltime,high school,NaN,single,yes,no,coffee,nonveg,0,7864
9,28,3,60.0,F,fulltime,bachelors,85000.0,married,no,no,coffee,nonveg,0,29287

In [79]:
coffee1 = pd.read_csv('coffee_info.csv', na_values='NA', usecols=[0,2,3,6], header=0, names=['uid', 'AgeGroup', 'Sex', 'Income'])
coffee1.head()

   uid  AgeGroup Sex   Income
0    5      60.0   F  45000.0
1    6      40.0   F  46000.0
2    9       NaN   F  47000.0
3   14      20.0   F  65000.0
4   15      50.0   F  46000.0

In [80]:
coffee3= pd.read_csv('coffee_info.csv', na_values='NA', usecols=[0,2,3,6], header=0, index_col=[0])
coffee3.head()

            Age Gender   Income
Person_ID
5          60.0      F  45000.0
6          40.0      F  46000.0
9           NaN      F  47000.0
14         20.0      F  65000.0
15         50.0      F  46000.0

In [89]:
records = [['John', 19, 'M', 89], ['Jack', np.NaN,'M', 63], ['Jane', 20, 'F', 91],['Mary', 20, 'F', np.NaN]]
titles = ['student', 'age', 'gender', 'mark']
v = np.arange(1,5)
X = pd.DataFrame(records, columns=titles, index=v)
X

  student   age gender  mark
1    John  19.0      M  89.0
2    Jack   NaN      M  63.0
3    Jane  20.0      F  91.0
4    Mary  20.0      F   NaN

In [91]:
X.to_csv('students_ex.csv', sep='|', na_rep='NA')

In [92]:
X.to_csv('students_ex.csv', sep='|', na_rep='NA',index_label='student_id')